# CutLayerName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerInfo..::..CutLayerName Property
ExportLayerInfo Class See Also
---
The cut layer name stored in value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string CutLayerName { get; set; }
```

Visual Basic
---
```text
Public Property CutLayerName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ CutLayerName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace